In [1]:
# random forest on fraud check dataset

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier

In [3]:
df=pd.read_csv("F:\\excelR\\assignments\\random forest assignment\\Fraud_check.csv")

In [4]:
df

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES
596,YES,Divorced,69967,55369,2,YES
597,NO,Divorced,47334,154058,0,YES
598,YES,Married,98592,180083,17,NO
599,NO,Divorced,96519,158137,16,NO

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [7]:
df=df.rename({'Marital.Status':'Marital_Status'},axis=1)
df=df.rename({'Taxable.Income':'Taxable_Income'},axis=1)
df=df.rename({'City.Population':'population'},axis=1)
df=df.rename({'Work.Experience':'experience'},axis=1)

In [8]:
df

    Undergrad Marital_Status  Taxable_Income  population  experience Urban
0          NO         Single           68833       50047          10   YES
1         YES       Divorced           33700      134075          18   YES
2          NO        Married           36925      160205          30   YES
3         YES         Single           50190      193264          15   YES
4          NO        Married           81002       27533          28    NO
..        ...            ...             ...         ...         ...   ...
595       YES       Divorced           76340       39492           7   YES
596       YES       Divorced           69967       55369           2   YES
597        NO       Divorced           47334      154058           0   YES
598       YES        Married           98592      180083          17    NO
599        NO       Divorced           96519      158137          16    NO

[600 rows x 6 columns]

In [9]:
tax_income=[]
for value in df['Taxable_Income']:
    if value<=30000:
         tax_income.append('risky')
    else:
           tax_income.append('good')
df['tax']= tax_income

In [10]:
df.head()

  Undergrad Marital_Status  Taxable_Income  population  experience Urban   tax
0        NO         Single           68833       50047          10   YES  good
1       YES       Divorced           33700      134075          18   YES  good
2        NO        Married           36925      160205          30   YES  good
3       YES         Single           50190      193264          15   YES  good
4        NO        Married           81002       27533          28    NO  good

In [11]:
df=df.drop(['Taxable_Income'],axis=1)

In [12]:
from sklearn.preprocessing import LabelEncoder

In [13]:
labelencoder=LabelEncoder()

In [14]:
df.iloc[:,0]=labelencoder.fit_transform(df.iloc[:,0])
df.iloc[:,1]=labelencoder.fit_transform(df.iloc[:,1])
df.iloc[:,-2]=labelencoder.fit_transform(df.iloc[:,-2])
df.iloc[:,-1]=labelencoder.fit_transform(df.iloc[:,-1])

In [15]:
x=df.iloc[:,0:5]
y=df.iloc[:,-1]

## random forest classification

In [16]:
num_trees = 200
max_features = 4
kfold = KFold(n_splits=15,  shuffle=True)
model = RandomForestClassifier(n_estimators=num_trees, max_features=max_features)
results_rfc = cross_val_score(model, x, y, cv=kfold)
print(results_rfc.mean())

0.7366666666666666

In [17]:
# bagging
from sklearn.ensemble import BaggingClassifier

seed = 7
kfold = KFold(n_splits=10, random_state=seed, shuffle=True)
cart = DecisionTreeClassifier()
num_trees = 100
model = BaggingClassifier(base_estimator=cart, n_estimators=num_trees, random_state=seed)
results_bag = cross_val_score(model, x, y, cv=kfold)
print(results_bag.mean())

0.7433333333333333

In [18]:
## Boosting 
from sklearn.ensemble import AdaBoostClassifier

num_trees = 10
seed=7
kfold = KFold(n_splits=10, random_state=seed, shuffle=True)
model = AdaBoostClassifier(n_estimators=num_trees, random_state=seed)
results_boost = cross_val_score(model, x, y, cv=kfold)
print(results_boost.mean())

0.7933333333333332

In [19]:
## Stacking 
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC
from sklearn.ensemble import VotingClassifier

In [20]:
estimators = []
model1 = LogisticRegression(max_iter=500)
estimators.append(('logistic', model1))
model2 = DecisionTreeClassifier()
estimators.append(('cart', model2))
model3 = SVC()
estimators.append(('svm', model3))

# Creating the ensemble model
ensemble = VotingClassifier(estimators)
results_stack = cross_val_score(ensemble, x, y, cv=kfold)
print(results_stack.mean())

0.7933333333333332

** boosting and stacking gave the highest accuracy**